export const movies = [
  {
    id: 1,
    title: "살목지",
    description:
      "기이한 소문이 끊이지 않는 저수지 살목지의 로드뷰 화면에 촬영한 적 없는 정체불명의 형체가 포착된다. 오늘 안에 반드시 재촬영을 끝내야 하는 상황 속에 살목지로 향한 PD 수인과 촬영팀. 촬영이 시작되자 행방이 묘연했던 선배 교식이 등장하고, 설명되지 않는 일들이 연달아 벌어지며 촬영팀은 점점 아비규환에 빠진다.",
    releaseDate: "2026-04-08",
    rating: 8.4,
    genre: "공포",
  },
  {
    id: 2,
    title: "악마는 프라다를 입는다 2",
    description:
      "전 세계를 열광시킨 런웨이 전설들의 귀환! 전 세계 트렌드를 주도해 온 전설적인 패션 매거진 런웨이가 급변하는 미디어 시장 속에서 예기치 못한 위기에 직면한다. 런웨이를 지켜내려는 편집장 미란다와 20년 만에 신임 기획 에디터로 당당히 돌아온 앤디, 그리고 이제는 럭셔리 브랜드 임원이 되어 다시 나타난 에밀리까지.",
    releaseDate: "2026-04-29",
    rating: 9.2,
    genre: "드라마",
  },
  {
    id: 3,
    title: "슈퍼 마리오 갤럭시",
    description:
      "브루클린의 배관공에서 세계를 구한 히어로로 레벨업한 형제 마리오와 루이지는 모래 왕국에서 임무를 수행하던 중, 길을 잃은 요시를 구출하며 특별한 우정을 쌓게 된다. 다시 찾아온 위기 속에서 마리오와 루이지, 피치, 키노피오 그리고 새로 합류한 요시까지 로젤리나도 구하고, 쿠파주니어의 비범한 계획을 막기 위해 넓은 갤럭시로 뛰어들게 되는데...",
    releaseDate: "2026-04-29",
    rating: 8.13,
    genre: "애니메이션",
  },
  {
    id: 4,
    title: "프로젝트 헤일메리",
    description:
      "죽어가는 태양, 종말 위기에 놓인 지구. 인류의 운명을 건 단 하나의 미션. 그의 마지막 임무가 시작된다! 눈을 떠보니 아득한 우주의 한가운데에서 깨어난 중학교 과학교사 그레이스는 희미한 기억 속에서 자신이 죽어가는 태양으로부터 지구와 인류를 살릴 마지막 희망으로 이곳에 왔다는 사실을 알게 된다.",
    releaseDate: "2026-03-18",
    rating: 9.21,
    genre: "SF",
  },
  {
    id: 5,
    title: "짱구",
    description:
      "99번째 오디션 낙방! 자빠져도 다시 한번! 배우가 되고 싶어 서울 자취러가 된 부산 사나이 짱구. 전기세도 못 낼 만큼 팍팍한 서울살이 속에서 되는 일은 좀처럼 없다. 하지만 짱구는 넘어지면 털고 일어나고 쪽팔리면 더 크게 웃는다. 인생이 뜻대로 안 풀릴 때 이렇게 버티는 방법도 있다. 무겁지 않다. 그렇다고 가볍지도 않다. 웃기면서 뜨겁다.",
    releaseDate: "2026-04-22",
    rating: 8.12,
    genre: "드라마",
  },
  {
    id: 6,
    title: "란 12.3",
    description:
      "그날 민주주의가 멈췄다. 2024년 12월 3일 밤, 윤석열 대통령의 기습적인 비상계엄 선포로 평화로웠던 일상이 깨졌다. 다시 반복된 과거의 그날처럼, 무장한 군 병력은 헌법 기관을 무력화하려 하고 계엄에 반대하여 민주주의를 지키려는 시민과 국회의원들은 국회로 몰려간다. 우리가 지켜낸 그날 밤의 기록을 담은 시네마틱 다큐멘터리.",
    releaseDate: "2026-04-22",
    rating: 9.93,
    genre: "다큐멘터리",
  },
];

export const genres = [
  "전체",
  "공포",
  "드라마",
  "애니메이션",
  "SF",
  "다큐멘터리",
];

export const sortOptions = [
  "기본순",
  "별점 높은순",
  "별점 낮은순",
  "최신순",
  "오래된순",
];
